Revit 2026 API

# IFCFileCreateStyle(ExporterIFC, IFCAnyHandle, Color, ElementId) Method

---

Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle, and assigns them to the file.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCAnyHandle CreateStyle(
	ExporterIFC exporterIFC,
	IFCAnyHandle repItem,
	Color color,
	ElementId fillPatternId
)
```
```vb
Public Function CreateStyle (
	exporterIFC As ExporterIFC,
	repItem As IFCAnyHandle,
	color As Color,
	fillPatternId As ElementId
) As IFCAnyHandle
```
```cpp
public:
IFCAnyHandle^ CreateStyle(
	ExporterIFC^ exporterIFC,
	IFCAnyHandle^ repItem,
	Color^ color,
	ElementId^ fillPatternId
)
```
```fsharp
member CreateStyle :
        exporterIFC : ExporterIFC *
        repItem : IFCAnyHandle *
        color : Color *
        fillPatternId : ElementId -> IFCAnyHandle
```

#### Parameters

exporterIFC ExporterIFC
     The exporter.
repItem IFCAnyHandle
     The representation item.
color Color
     The color.
fillPatternId ElementId
     The fill pattern id.

#### Return Value

IFCAnyHandle The handle.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | A transaction is required for this operation. |

#### Reference

IFCFile Class

CreateStyle Overload

Autodesk.Revit.DB.IFC Namespace